org-tutorials/org-appearance.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-15 Tue 18:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org appearance</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Worg people" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
 <link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Org appearance</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org798fcb6">Customizing Org appearance</a>
<ul>
<li><a href="#org2db5825">Customize Org-mode faces</a></li>
<li><a href="#orgb19e0d4">Hiding leading stars</a></li>
<li><a href="#org6b18a4b">Customizing the title, date, author and email lines.</a></li>
<li><a href="#org9c03c6a">Using only odd outline levels</a></li>
</ul>
</li>
<li><a href="#orgd4deabc">Org-mode ready color-themes</a></li>
</ul>
</div>
</div>
<p>
<a href="index.html">{Back to Worg&rsquo;s index}</a>
</p>

<p>
This page is about customizing the appearance of Org-mode.
</p>

<div id="outline-container-org798fcb6" class="outline-2">
<h2 id="org798fcb6">Customizing Org appearance</h2>
<div class="outline-text-2" id="text-org798fcb6">
<p>
To customize all aspects of Org appearance use
</p>

<pre class="example">
=M-x customize-group RET org-appearance RET=
</pre>

<p>
Here you will find several options that can be chaged, and a further
link to a page for customizing <a href="#org2db5825">Org-mode faces</a>.
</p>
</div>

<div id="outline-container-org2db5825" class="outline-3">
<h3 id="org2db5825">Customize Org-mode faces</h3>
<div class="outline-text-3" id="text-org2db5825">
<p>
A &ldquo;face&rdquo; is the term emacs uses to refer to the font and colour of
some text (as well as other features such as underlining etc).
</p>

<p>
Customizing Org faces is straightforward:
</p>

<pre class="example">
=M-x customize-group RET org-faces RET=
</pre>

<p>
You can also customize faces on the fly by just calling the
<code>customize-face</code> command with the cursor on the face you want to
customize.
</p>
</div>
</div>

<div id="outline-container-orgb19e0d4" class="outline-3">
<h3 id="orgb19e0d4">Hiding leading stars</h3>
<div class="outline-text-3" id="text-orgb19e0d4">
<p>
the variable org-hide-leading-stars can be configured so that only
one star is shown at the start of each heading. Many people find
that this give the org buffer a cleaner appearance. This can be set
in the Org Font Lock customize group as explained above in
<a href="#org798fcb6">Customizing Org appearance</a>.
</p>
</div>
</div>

<div id="outline-container-org6b18a4b" class="outline-3">
<h3 id="org6b18a4b">Customizing the title, date, author and email lines.</h3>
<div class="outline-text-3" id="text-org6b18a4b">
<p>
The title, date and author information for an org document are
specified using the special keywords <code>#+TITLE:</code>, <code>#+DATE</code>,
<code>#+AUTHOR</code>, <code>#+EMAIL</code>.
</p>

<p>
By default, title, author, date and email lines appear in dark blue
with the initial keywords greyed out. The title is in a larger font
than the others. To change this, customize the faces
</p>

<ul class="org-ul">
<li>org-document-title</li>
<li>org-document-info</li>
<li>org-document-info-keyword</li>
</ul>

<p>
In addition, the variable org-hidden-keywords can be used to make the
corresponding keywords disappear.
</p>
</div>
</div>

<div id="outline-container-org9c03c6a" class="outline-3">
<h3 id="org9c03c6a">Using only odd outline levels</h3>
<div class="outline-text-3" id="text-org9c03c6a">
<p>
The variable org-odd-levels-only can be used so that Org only uses
odd-numbered outline levels. Again, some people prefer this, finding
that the Org buffer looks less cluttered.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd4deabc" class="outline-2">
<h2 id="orgd4deabc">Org-mode ready color-themes</h2>
<div class="outline-text-2" id="text-orgd4deabc">
<p>
Check out the list of <a href="../org-color-themes.html">color themes</a> that are aware of org-mode.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Worg people</p>
<p class="date">Created: 2021-06-15 Tue 18:24</p>
</div>
</body>
</html>
